vlm/base/Catalogs/ТехнологическиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТехнологическиеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.МаршрутныеКарты</xr:Item>
				<xr:Item>Catalog.ТехнологическиеПроцессы</xr:Item>
				<xr:Item>Catalog.ЭтапыПроизводства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитВложенныйМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйМаршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяШтучноеЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПЗЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Непрерывная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор операции в маршрутной карте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаточнаяПартия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноПовторить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноПропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТехнологическогоПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Comment>Служебный реквизит для оптимизации запросов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НормаВыработки</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КоличествоХодов</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НормаВремени</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ТехнологическаяСкорость</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_РасчетнаяМассаПровода</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КоэффициентИспользованияОборудования</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВыработкаПроводаСоВсейМашины</Name>
					<Comment>ЛТ 1.6</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КодОперации</Name>
					<Comment>ЛТ33</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КодыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_АгрегирующийКоэффициент</Name>
					<Comment>ЛТ33</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_РучнойВводНормыВыработки</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВспомогательныеРабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормативыВидаОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/Catalogs/ТехнологическиеОперации/Forms/бит_ФормаНормыВыработки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +

	ЗаполнитьНоменклатуруИВидРабочегоЦентра();

	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

Процедура ЗаполнитьНоменклатуруИВидРабочегоЦентра()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +

	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Ссылка,
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_СпецификацияНоменклатура
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникТехнологическиеОперации.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА СправочникТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
		|			ТОГДА ВЫРАЗИТЬ(СправочникТехнологическиеОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра
		|		ИНАЧЕ СправочникТехнологическиеОперации.РабочийЦентр
		|	КОНЕЦ КАК ВидРабочегоЦентра,
		|	вт_СпецификацияНоменклатура.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК СправочникТехнологическиеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СпецификацияНоменклатура КАК вт_СпецификацияНоменклатура
		|		ПО (СправочникТехнологическиеОперации.Спецификация = вт_СпецификацияНоменклатура.Ссылка)
		|ГДЕ
		|	СправочникТехнологическиеОперации.Ссылка = &Ссылка");

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Номенклатура = Выборка.Номенклатура;
		ВидРабочегоЦентра = Выборка.ВидРабочегоЦентра;
		
	КонецЦикла; 
	
	бит_Номенклатура = Номенклатура;
	бит_ВидРабочегоЦентра = ВидРабочегоЦентра;	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_НормаВыработкиПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_НормаВыработкиПриИзмененииНаСервере(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_КоличествоХодовПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_НормаВремениПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_НормаВремениПриИзмененииНаСервере(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_ТехнологическаяСкоростьПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_РасчетнаяМассаПроводаПриИзменении(Элемент)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаКлиенте
Процедура бит_КоэффициентИспользованияОборудованияПриИзменении(Элемент) 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины(); 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -

КонецПроцедуры

&НаСервере
Процедура бит_ПересчитатьВыработкуПроводаСоВсейМашины()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	Объект.бит_ВыработкаПроводаСоВсейМашины = ((Объект.бит_ТехнологическаяСкорость * 6 / 100) 
												* Объект.бит_РасчетнаяМассаПровода 
												* Объект.бит_КоличествоХодов 
												* Объект.бит_КоэффициентИспользованияОборудования);	
																		
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры

&НаСервере
Процедура бит_НормаВыработкиПриИзмененииНаСервере() 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	Если Объект.бит_НормаВыработки = 0 Тогда
		Объект.бит_НормаВремени = 0;
		Объект.ВремяШтучное = 0;
	Иначе		
		Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		Объект.бит_НормаВремени = 1 / Объект.бит_НормаВыработки;
		Объект.ВремяШтучное = Объект.бит_НормаВремени * 60; 
	КонецЕсли;	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры  

&НаСервере
Процедура бит_НормаВремениПриИзмененииНаСервере() 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 +
	
	Если Объект.бит_НормаВремени = 0 Тогда
		Объект.бит_НормаВыработки = 0;
		Объект.ВремяШтучное = 0;
	Иначе		
		Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		Объект.бит_НормаВыработки = 1 / Объект.бит_НормаВремени;
		Объект.ВремяШтучное = Объект.бит_НормаВремени * 60; 
	КонецЕсли;	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 07.02.2025 -
	
КонецПроцедуры
